#### MetalPatternType Enumeration

---

|  |
| --- |
| See Also |

The enumerated type representing the permitted values for the asset property "MetalPattern" from the "Metal" schema.

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)

# Syntax

| C# |
| --- |
| ``` public enum MetalPatternType ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration MetalPatternType ``` |

| Visual C++ |
| --- |
| ``` public enum class MetalPatternType ``` |

# Members

| Member name | Description |
| --- | --- |
| None |  |
| Knurl |  |
| DiamondPlate |  |
| CheckerPlate |  |
| Custom |  |

# See Also

Autodesk.Revit.DB.Visual Namespace